/*ДЗ1 Тусувати масив
Ми знаємо як відсортувати масив. А ось спробуйте його перемішати!
Приклад масиву: arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
Напишіть функцію myBlend(arr), яка перемішуватиме переданий їй масив.
Зверніть увагу: не створювати новий масив, вже перемішаний, а саме перемішувати той, який їй передали.*/

let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
console.log("Our array is: " + arr);
console.log("Sort array is: " + arr.sort(myBlend));


function myBlend(arrRend) {
    arrRend = Math.random() - (0.5); // 0.5 - 50% шанса получить как a-b, так и b-a
    return arrRend
}
