//Homework #3: Data Types
//
let dt1 = 'number' + 3 + 3;
console.log(dt1);
//У результаті виразу: 'number' + 3 + 3, отримуємо: 'number33' --> тому що 'number' - строка, '+' - конкатенація

let dt2 = null + 3;
console.log(dt2);
//У результаті виразу: null + 3, отримуємо: '3' --> тому що 'null' - пустота, плюс '3'

let dt3 = 5 && "qwerty";
console.log(dt3);
/*У результаті виразу: 5 && "qwerty", отримуємо: 'qwerty' -->
тому що у виразі з '&&' маэмо обидва значення true, тому повертається останнє обчислене значення*/

let dt4 = +'40' + +'2' + "hillel";
console.log(dt4);
/*У результаті виразу: +'40' + +'2' + "hillel", отримуємо: '42hillel' -->
тому що строкові значення '40' та '2' привелись до числа та зконкатенувались (якщо є таке слово :) зі строкою "hillel" */

let dt5 = '10' - 5 === 6;
console.log(dt5);
/*У результаті виразу: '10' - 5 === 6, отримуємо: 'false' --> тому що
Мінус більш пріоритетний, ніж рівняння, тому: '10' стало числом, мінус 5 дорівнює 5, та не дорівнює 6*/

let dt6 = true + false
console.log(dt6);
//У результаті виразу: true + false, отримуємо: '1' --> тому що true (це 1) + false (це 0) = 1 + 0 = 1;

let dt7 = '4px' - 3
console.log(dt7);
//У результаті виразу: '4px' - 3, отримуємо: 'NaN' --> тому що строка мінус число = NaN;

let dt8 = '4' - 3
console.log(dt8);
//У результаті виразу: '4' - 3, отримуємо: '1' --> тому що строка '4' змінила тип на число та відняло 3;

let dt9 = '6' + 3 ** 0;
console.log(dt9);
/*У результаті виразу: '6' + 3 ** 0, отримуємо: '61' --> тому що
Зведення до ступеня пріоритетніше, ніж сума, тому спочатку 3 піднесли до степеня 0, отримали одиницю.
А потім строку '6' (строка '6' не була перетворена до числа) зконкатенували з числом 1;*/

let dt10 =  12 / '6'
console.log(dt10);
//У результаті виразу: 12 / '6', отримуємо: '2' --> тому, що число / на строку, яка стала числом

let dt11 = '10' + (5 === 6);
console.log(dt11);
/*У результаті виразу: '10' + (5 === 6), отримуємо: '10false' -->
тому що спочатку перевірили рівняння (тобто у скобках не число, а boolean), а потім зконкатенували зі строкою '10';*/

let dt12 = null == '';
console.log(dt12);
//У результаті виразу: null == '', отримуємо: 'false' --> тому що null дорівнює тільки undefined

let dt13 = 3 ** (9 / 3);
console.log(dt13);
//У результаті виразу: 3 ** (9 / 3), отримуємо: '27' --> тому що спочатку дія у скобках, потім 3 у ступеня 3

let dt14 = !!'false' == !!'true'
console.log(dt14);
//У результаті виразу: !!'false' == !!'true', отримуємо: 'true' --> тому що !!строка = true

let dt15 = 0 || '0' && 1
console.log(dt15);
/*У результаті виразу: 0 || '0' && 1, отримуємо: '1' --> тому що:
1) 0 (false) || '0' (true) - цей вираз дає нам true, тому що повертає true якщо одне значення рівне true
2) true && 1 - це true, та виводиться останнє значення 1.*/

let dt16 = (+null == false) < 1;
console.log(dt16);
/*У результаті виразу: (+null == false) < 1, отримуємо: 'false' -->
тому що +null - це '0' та дорівнює false, тобто у скобках в нас true, яке не менше, а дорівнює '1'*/

let dt17 = false && true || true
console.log(dt17);
//У результаті виразу: false && true || true, отримуємо: 'true' --> тому що
//1) false && true - дає нам false;
//2) false || true - дає нам true.

let dt18 = false && (false || true);
console.log(dt18);
/*У результаті виразу: false && (false || true), отримуємо: 'false' --> тому що
1) перший вираз у скобках: false || true - дає нам true;
2) false && true - дає нам false.*/

let dt19 = (+null == false) < 1 ** 5;
console.log(dt19);
/*У результаті виразу: (+null == false) < 1 ** 5;, отримуємо: 'false' --> тому що
1) перший вираз у скобках: +null == false - дає нам true;
2) true не може бути < 1 (навіть якщо 1^5) - дає нам false.*/